ГТС/УТГТС/Enums/ВариантыОбособленияТоваровВоВнутреннемПотреблении.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыОбособленияТоваровВоВнутреннемПотреблении</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаВнутреннееПотребление</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/ВариантыОбособленияТоваровВПеремещении.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыОбособленияТоваровВПеремещении</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НазначениеПолучателя</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаПеремещение</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/ВариантыОбособленияТоваровВПродажах.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыОбособленияТоваровВПродажах</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказКлиента</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Договор</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Enums/ВариантыОбособленияТоваровВСборке.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВариантыОбособленияТоваровВСборке</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>НаправлениеДеятельности</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НазначениеСобираемогоКомплекта</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаказНаСборку</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

ГТС/УТГТС/Constants/ФормироватьФинансовыйРезультат/Ext/ValueManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ОбработчикиСобытий

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// При отключении опции, для вариантов обособления по направлению деятельности установим значения по умолчанию.
	Если Не ЭтотОбъект.Значение = Истина Тогда
		
		Если Константы.ВариантОбособленияТоваровВоВнутреннемПотреблении.Получить() =
			Перечисления.ВариантыОбособленияТоваровВоВнутреннемПотреблении.НаправлениеДеятельности Тогда
			
			Константы.ВариантОбособленияТоваровВоВнутреннемПотреблении.Установить(Перечисления.ВариантыОбособленияТоваровВоВнутреннемПотреблении.ЗаказНаВнутреннееПотребление);
			
		КонецЕсли;
		
		Если Константы.ВариантОбособленияТоваровВПеремещении.Получить() =
			Перечисления.ВариантыОбособленияТоваровВПеремещении.НаправлениеДеятельности Тогда
			
			Константы.ВариантОбособленияТоваровВПеремещении.Установить(Перечисления.ВариантыОбособленияТоваровВПеремещении.НазначениеПолучателя);
			
		КонецЕсли;
		
		Если Константы.ВариантОбособленияТоваровВПродажах.Получить() =
			Перечисления.ВариантыОбособленияТоваровВПродажах.НаправлениеДеятельности Тогда
			
			Константы.ВариантОбособленияТоваровВПродажах.Установить(Перечисления.ВариантыОбособленияТоваровВПродажах.ЗаказКлиента);
			
		КонецЕсли;
		
		Если Константы.ВариантОбособленияТоваровВСборке.Получить() =
			Перечисления.ВариантыОбособленияТоваровВСборке.НаправлениеДеятельности Тогда
			
			Константы.ВариантОбособленияТоваровВСборке.Установить(Перечисления.ВариантыОбособленияТоваровВСборке.НазначениеСобираемогоКомплекта);
			
		КонецЕсли;
		
		
	
	КонецЕсли;
	
КонецПроцедуры

#КонецОбласти

#КонецЕсли
